# Создать образ на основе базового слоя python (там будет ОС и интерпретатор Python).

FROM python:3.8-slim

# Запустить команду создания директории внутри контейнера
RUN mkdir /app

# Скопировать с локального компьютера файл зависимостей в директорию /app.
COPY requirements.txt /app
COPY pyrustools-0.4.4.48-py3-none-any.whl /app


# Выполнить установку зависимостей внутри контейнера.
RUN pip install -r /app/requirements.txt --no-cache-dir

# Скопировать содержимое директории c локального компьютера в директорию /app.
COPY . /app

# Сделать директорию /app рабочей директорией.
WORKDIR /app

# Выполнить запуск сервера разработки при старте контейнера.
CMD [ "python3", "-m" , "flask", "run", "--host=0.0.0.0"]

EXPOSE 5000
